export const dataWithTag = [
  // ----------01---------------
  {
    name: "โรงเรียนบ้านปลาดาว",
    link: "Starfish",
    tags: [
      // ประเภทของหน่วยงาน
      "โครงการต่อเนื่องระยะยาว",

      // ปัจจัยความสำเร็จ
      "ทุน",
      "การบริหารจัดการ",
      "การปรับเป้าหมายและทิศทาง",
      "การเข้าถึงข้อมูล",
      "ความร่วมมือของคนในทีม",

      // กลุ่มเป้าหมาย
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",
      "อนุบาล",

      // พื้นที่การทำงาน
      "ภาคเหนือ",

      // เป้าหมายการพัฒนา
      "ทัศนคติต่อการเรียนรู้ตลอดชีวิต",
      "ส่งเสริมการทำงานร่วมกัน",

      // ปัญหาในการทำงาน
      "ทรัพยากรบุคคล",
      "โครงสร้างของรัฐ",
    ],
  },
  // ---------------------------

  // ----------02---------------
  {
    name: "โครงการครูรักษ์ถิ่น",
    link: "Conserve",
    tags: [
      // ประเภทของหน่วยงาน
      "โครงการต่อเนื่องระยะยาว",

      // ปัจจัยความสำเร็จ
      "เครือข่าย",
      "ทุน",
      "การสร้างทายาท",

      // กลุ่มเป้าหมาย
      "กลุ่มคนทำงาน (25 - 60 ปี)",

      // พื้นที่การทำงาน
      "ภาคกลาง",
      "ภาคเหนือ",
      "ภาคตะวันออกเฉียงเหนือ",
      "ภาคตะวันออก",
      "ภาคตะวันตก",
      "ภาคใต้",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ส่งเสริมการทำงานร่วมกัน",
      "ตอบสนองความต้องการของพื้นที่",

      // ปัญหาในการทำงาน
      "โครงสร้างของรัฐ",
      "ความร่วมมือของหน่วยงานภาครัฐหลายฝ่าย",
    ],
  },
  // ---------------------------

  // ----------03---------------
  {
    name: "โครงการก่อการครู",
    link: "TechMaker",
    tags: [
      // ประเภทของหน่วยงาน
      "โครงการต่อเนื่องระยะยาว",

      // ปัจจัยความสำเร็จ
      "เครือข่าย",
      "ทุน",
      "การบริหารจัดการ",
      "ความร่วมมือของชุมชน / นิเวศเชิงพื้นที่",
      "ทัศนคติของคนในสังคม",
      "ความสามารถในการปรับตัวกับสถานการณ์",
      "การเท่าทันการเปลี่ยนแปลง",
      "การขยายมุมมอง",
      "การได้ลงมือทำ",
      "ความเข้าใจประเด็นในพื้นที่",
      "การให้พลังใจในการทำงานระหว่างกัน",

      // กลุ่มเป้าหมาย
      "กลุ่มคนทำงาน (25 - 60 ปี)",

      // พื้นที่การทำงาน
      "ภาคกลาง",
      "ภาคเหนือ",
      "ภาคตะวันออกเฉียงเหนือ",
      "ภาคตะวันออก",
      "ภาคตะวันตก",
      "ภาคใต้",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ทัศนคติต่อการเรียนรู้ตลอดชีวิต",

      // ปัญหาในการทำงาน
      "ความขัดแย้งทางความคิดในเครือข่าย",
      "โครงสร้างของรัฐ",
    ],
  },
  // ---------------------------

  // ----------04---------------
  {
    name: "โครงการโรงเรียนพัฒนาตนเอง",
    link: "SelfImprove",
    tags: [
      // ประเภทของหน่วยงาน
      "โครงการต่อเนื่องระยะยาว",

      // ปัจจัยความสำเร็จ
      "เครือข่าย",
      "การบริหารจัดการ",

      // กลุ่มเป้าหมาย
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนปลาย (16 - 18 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนต้น (12 - 15 ปี)",
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",

      // พื้นที่การทำงาน
      "ภาคกลาง",
      "ภาคเหนือ",
      "ภาคตะวันออกเฉียงเหนือ",
      "ภาคตะวันออก",
      "ภาคตะวันตก",
      "ภาคใต้",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ทักษะการสื่อสาร",
      "ทักษะความคิดสร้างสรรค์",
      "ความรู้การจัดการสภาพแวดล้อม ความเป็นอยู่",
      "ทัศนคติต่อการเรียนรู้ตลอดชีวิต",
      "ทัศนคติการมีส่วนร่วมต่อสังคม",
      "ส่งเสริมการทำงานร่วมกัน",

      // ปัญหาในการทำงาน
      "ทรัพยากรบุคคล",
      "โครงสร้างของรัฐ",
    ],
  },
  // ---------------------------

  // ----------06---------------
  {
    name: "กลุ่มรักษ์เขาชะเมา",
    link: "KhaoChamao",
    tags: [
      // ประเภทของหน่วยงาน
      "หน่วยงานขับเคลื่อนระดับพื้นที่",

      // ปัจจัยความสำเร็จ
      "เครือข่าย",
      "ทุน",
      "การบริหารจัดการ",
      "ความร่วมมือของชุมชน / นิเวศเชิงพื้นที่",

      // กลุ่มเป้าหมาย
      "กลุ่มคนทำงาน (25 - 60 ปี)",
      "กลุ่มนักศึกษามหาวิทยาลัย (18 - 25 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนปลาย (16 - 18 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนต้น (12 - 15 ปี)",
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",
      "กลุ่มผู้ปกครอง",

      // พื้นที่การทำงาน
      "ภาคตะวันออก",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ความรู้ภูมิปัญญาท้องถิ่น",
      "ความรู้การจัดการสภาพแวดล้อม ความเป็นอยู่",
      "ทัศนคติการมีส่วนร่วมต่อสังคม",

      // ปัญหาในการทำงาน
      "การละเลยจากภาครัฐ",
    ],
  },
  // ---------------------------

  // ----------08---------------
  {
    name: "กลุ่มมะขามป้อม",
    link: "Indiangooseberry",
    tags: [
      // ประเภทของหน่วยงาน
      "หน่วยงานขับเคลื่อนระดับพื้นที่",

      // ปัจจัยความสำเร็จ
      "เครือข่าย",
      "การเท่าทันการเปลี่ยนแปลง",

      // กลุ่มเป้าหมาย
      "กลุ่มคนทำงาน (25 - 60 ปี)",
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",

      // พื้นที่การทำงาน
      "ภาคเหนือ",

      // เป้าหมายการพัฒนา
      "ทักษะความคิดสร้างสรรค์",
      "ทักษะรู้เท่าทันสื่อสารสนเทศ",
      "ทัศนคติต่อการเรียนรู้ตลอดชีวิต",

      // ปัญหาในการทำงาน
      "ทรัพยากรบุคคล",
    ],
  },
  // ---------------------------

  // ----------09---------------
  {
    name: "สวนศิลป์บินสิ",
    link: "Artist",
    tags: [
      // ประเภทของหน่วยงาน
      "หน่วยงานขับเคลื่อนระดับพื้นที่",

      // ปัจจัยความสำเร็จ
      "การปรับเป้าหมายและทิศทาง",
      "การได้ลงมือทำ",
      "ความเข้าใจประเด็นในพื้นที่",

      // กลุ่มเป้าหมาย
      "กลุ่มคนทำงาน (25 - 60 ปี)",
      "กลุ่มนักศึกษามหาวิทยาลัย (18 - 25 ปี)",
      "กลุ่มผู้ปกครอง",

      // พื้นที่การทำงาน
      "ภาคเหนือ",

      // เป้าหมายการพัฒนา
      "ทักษะรู้เท่าทันสื่อสารสนเทศ",
      "ความรู้การจัดการสภาพแวดล้อม ความเป็นอยู่",

      // ปัญหาในการทำงาน
      "ทรัพยากรบุคคล",
    ],
  },
  // ---------------------------

  // ----------11---------------
  {
    name: "โครงการกลุ่มไม้ขีดไฟ",
    link: "MatchStick",
    tags: [
      // ประเภทของหน่วยงาน
      "หน่วยงานขับเคลื่อนระดับพื้นที่",

      // ปัจจัยความสำเร็จ
      "การสร้างทายาท",
      "ความร่วมมือของชุมชน / นิเวศเชิงพื้นที่",
      "ทัศนคติของคนในสังคม",
      "การขยายมุมมอง",
      "การได้ลงมือทำ",

      // กลุ่มเป้าหมาย
      "ผู้สูงอายุ (> 60 ปี)",
      "กลุ่มคนทำงาน (25 - 60 ปี)",
      "กลุ่มนักศึกษามหาวิทยาลัย (18 - 25 ปี)",
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",
      "อนุบาล",
      "กลุ่มผู้ปกครอง",

      // พื้นที่การทำงาน
      "ภาคกลาง",
      "ภาคเหนือ",
      "ภาคตะวันออกเฉียงเหนือ",
      "ภาคตะวันออก",
      "ภาคตะวันตก",
      "ภาคใต้",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ความรู้ภูมิปัญญาท้องถิ่น",
      "ทัศนคติต่อการเคารพความแตกต่างหลากหลาย",

      // ปัญหาในการทำงาน
      "ความขัดแย้งทางความคิดในเครือข่าย",
      "การละเลยจากภาครัฐ",
    ],
  },
  // ---------------------------

  // ----------12---------------
  {
    name: "บ้านอุทัยยิ้ม",
    link: "UthaiYim",
    tags: [
      // ประเภทของหน่วยงาน
      "หน่วยงานขับเคลื่อนระดับพื้นที่",

      // ปัจจัยความสำเร็จ
      "การสร้างทายาท",
      "ความร่วมมือของชุมชน / นิเวศเชิงพื้นที่",
      "ความร่วมมือของคนในทีม",

      // กลุ่มเป้าหมาย
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",

      // พื้นที่การทำงาน
      "ภาคกลาง",

      // เป้าหมายการพัฒนา
      "ความรู้ภูมิปัญญาท้องถิ่น",
      "ตอบสนองความต้องการของพื้นที่",

      // ปัญหาในการทำงาน
      "ทรัพยากรบุคคล",
      "โครงสร้างของรัฐ",
    ],
  },
  // ---------------------------

  // ----------13---------------
  {
    name: "สถาบันการเรียนรู้ไทยเบิ้ง",
    link: "ThaiBoeng",
    tags: [
      // ประเภทของหน่วยงาน
      "หน่วยงานขับเคลื่อนระดับพื้นที่",

      // ปัจจัยความสำเร็จ
      "เครือข่าย",
      "ทุน",
      "การสร้างทายาท",
      "ความร่วมมือของชุมชน / นิเวศเชิงพื้นที่",
      "ความเข้าใจประเด็นในพื้นที่",

      // กลุ่มเป้าหมาย
      "ผู้สูงอายุ (> 60 ปี)",
      "กลุ่มคนทำงาน (25 - 60 ปี)",
      "กลุ่มนักศึกษามหาวิทยาลัย (18 - 25 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนปลาย (16 - 18 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนต้น (12 - 15 ปี)",
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",
      "อนุบาล",
      "กลุ่มผู้ปกครอง",

      // พื้นที่การทำงาน
      "ภาคกลาง",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ความรู้ภูมิปัญญาท้องถิ่น",
      "ความรู้การจัดการสภาพแวดล้อม ความเป็นอยู่",

      // ปัญหาในการทำงาน
      "ความร่วมมือของหน่วยงานภาครัฐหลายฝ่าย",
    ],
  },
  // ---------------------------

  // ----------19---------------
  {
    name: "หอภาพยนต์",
    link: "MovieArchives",
    tags: [
      // ประเภทของหน่วยงาน
      "organization & learning space",

      // ปัจจัยความสำเร็จ
      "การบริหารจัดการ",
      "ทัศนคติของคนในสังคม",
      "ความสามารถในการปรับตัวกับสถานการณ์",
      "การเข้าถึงข้อมูล",
      "ความร่วมมือของคนในทีม",

      // กลุ่มเป้าหมาย
      "ผู้สูงอายุ (> 60 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนปลาย (16 - 18 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนต้น (12 - 15 ปี)",
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี)",
      "อนุบาล",
      "กลุ่มผู้ปกครอง",

      // พื้นที่การทำงาน
      "ภาคกลาง",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ทักษะรู้เท่าทันสื่อสารสนเทศ",
      "ทัศนคติการมีส่วนร่วมต่อสังคม",
      "ส่งเสริมการทำงานร่วมกัน",
      "ตอบสนองความต้องการของพื้นที่",

      // ปัญหาในการทำงาน
      "ความขัดแย้งทางความคิดในเครือข่าย",
      "โครงสร้างของรัฐ",
    ],
  },
  // ---------------------------

  // ----------21---------------
  {
    name: "ศูนย์มานุษยวิทยาสิรินธร",
    link: "Sirindhorn",
    tags: [
      // ประเภทของหน่วยงาน
      "organization & learning space",

      // ปัจจัยความสำเร็จ
      "ทุน",
      "การบริหารจัดการ",
      "ความร่วมมือของคนในทีม",

      // กลุ่มเป้าหมาย
      "กลุ่มคนทำงาน (25 - 60 ปี)",
      "กลุ่มนักศึกษามหาวิทยาลัย (18 - 25 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนปลาย (16 - 18 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนต้น (12 - 15 ปี)",

      // พื้นที่การทำงาน
      "ภาคกลาง",

      // เป้าหมายการพัฒนา
      "ทักษะความคิดสร้างสรรค์",
      "ความรู้การจัดการสภาพแวดล้อม ความเป็นอยู่",
      "ทัศนคติการมีส่วนร่วมต่อสังคม",

      // ปัญหาในการทำงาน
      "ทรัพยากรบุคคล",
    ],
  },
  // ---------------------------

  // ----------22---------------
  {
    name: "Saturday School",
    link: "SaturdaySchool",
    tags: [
      // ประเภทของหน่วยงาน
      "Edupreneurs",

      // ปัจจัยความสำเร็จ
      "เครือข่าย",
      "การบริหารจัดการ",
      "ความร่วมมือของชุมชน / นิเวศเชิงพื้นที่",
      "ทัศนคติของคนในสังคม",
      "การขยายมุมมอง",
      "การได้ลงมือทำ",
      "ความร่วมมือของคนในทีม",

      // กลุ่มเป้าหมาย
      "กลุ่มคนทำงาน (25 - 60 ปี)",
      "กลุ่มนักศึกษามหาวิทยาลัย (18 - 25 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนปลาย (16 - 18 ปี)",
      "กลุ่มนักเรียนระดับชั้นมัธยมศึกษาตอนต้น (12 - 15 ปี)",
      "กลุ่มนักเรียนชั้นประถมศึกษา (6 - 11 ปี",

      // พื้นที่การทำงาน
      "ภาคกลาง",
      "ภาคใต้",

      // เป้าหมายการพัฒนา
      "การสร้างกลุ่มคนรุ่นต่อไป",
      "ทัศนคติต่อการเรียนรู้ตลอดชีวิต",
      "ทัศนคติการมีส่วนร่วมต่อสังคม",
      "ส่งเสริมการทำงานร่วมกัน",

      // ปัญหาในการทำงาน
      "ทรัพยากรบุคคล",
    ],
  },
  // ---------------------------
];
